Repository: xandefreitas/Flutter_Profile
Catalog: lib/l10n/app_*.arb
Languages: sv

# onboardingWelcomeMessage
source: Welcome to my app, here you will find a little of my experiences and hablities with Flutter!
sv: Välkommen till min app, här hittar du några av mina erfarenheter och färdigheter med Flutter!

# onboardingLoginMessage
source: Before we continue, verify your Phone Number
sv: Innan vi fortsätter ber vi dig verifiera ditt telefonnummer

# onboardingEnterNameMessage
source: Almost done! Now please inform your Name
sv: Nästan klar! Ange nu ditt namn

# onboardingCompleteMessage
source: All set! Let's Continue to the app!
sv: Redo! Låt oss gå vidare till appen!

# onboardingProceedButtonText
source: Proceed
sv: Fortsätta

# onboardingNextButtonText
source: Next
sv: Nästa

# loginAsAnonymousButtonText
source: Login as anonymous
sv: Logga in som anonym

# drawerTitleContactMe
source: Contact Me
sv: Kontakta mig

# drawerCallSwedenButton
source: Call my Swedish number!
sv: Ring mig: Sverige!

# drawerCallBrazilButton
source: Call my Brazilian number!
sv: Ring mig: Brasilien!

# drawerEmailButton
source: Send me an E-Mail
sv: Skicka mig ett mail!

# drawerTitleDownloadMyCV
source: Download my CV
sv: Ladda ner mitt CV

# drawerTitleLanguage
source: Language
sv: Språk

# portugueseLabel
source: Portuguese
sv: Portugisiska

# englishLabel
source: English
sv: Engelsk

# spanishLabel
source: Spanish
sv: Spanska

# drawerLogoutButton
source: Exit
sv: Utgång

# formHintTextName
source: Name
sv: Namn

# formValidatorMessage
source: Required Field
sv: Obligatoriskt Fält

# formEditNumberButtonText
source: Edit Number
sv: Redigera Nummer

# formResendButtonText
source: Resend
sv: Skicka igen

# formPhoneNumberLabelText
source: Phone Number
sv: Telefonnummer

# formFieldMinLengthMessage
source: Name must have more than 4 letters
sv: Namnet måste ha fler än 4 bokstäver

# profileTitle
source: Profile
sv: Profil

# certificatesTitle
source: Certificates
sv: Certifikat

# certificatesSubtitle
source: Check out my certificates!
sv: Kolla in mina certifikat!

# workHistoryTitle
source: Work History
sv: Jobbhistorik

# workHistorySubtitle
source: Know my previous experiences!
sv: Känn till mina tidigare erfarenheter!

# depositionsTitle
source: Depositions
sv: Vittnesbörd

# depositionsSubtitle
source: Write something about me or my app!
sv: Skriv något om mig eller min app!

# depositionsSecondarySubtitle
source: Login to leave your deposition!
sv: Logga in för att lämna ditt vittnesbörd!

# profileLoginMessage
source: Verify your Phone Number to access more app functionalities
sv: Verifiera ditt telefonnummer för att komma åt fler appfunktioner!

# profileRole
source: Software Developer
sv: Mjukvaruutvecklare

# alertSnackBarLoginTitle
source: Login First!
sv: Logga in först!

# alertSnackBarLoginMessage
source: You have to login to access this functionality
sv: Du måste logga in för att komma åt den här funktionen

# errorSnackBarInvalidCodeTitle
source: Code is Invalid!
sv: Koden är ogiltig!

# errorSnackBarInvalidCodeMessage
source: Try again or tap Resend to get a new code.
sv: Försök igen eller tryck på Skicka igen för att få en ny kod.

# profileMenuButton
source: Menu
sv: Meny

# profileLoginButton
source: Login
sv: Logga in

# aboutMeProfileLabel
source: About Me:
sv: Om Mig:

# skillsProfileLabel
source: Skills:
sv: Kompetens:

# skillsDeleteDialogTitle
source: Delete Skill
sv: Ta bort kompetens

# skillsDeleteDialogContent
source: Are you sure you want to delete this skill from the list?
sv: Är du säker på att du vill ta bort denna kompetens från listan?

# skillsDeleteDialogCancelButton
source: Cancel
sv: Annullera

# skillsDeleteDialogConfirmButton
source: Confirm
sv: Bekräfta

# skillsAddDialogTitle
source: New Skill
sv: Ny kompetens

# skillsAddDialogAddButton
source: Add
sv: Lägg till

# languagesProfileLabel
source: Languages:
sv: Språk:

# aboutMeDescription
source: Highly passionate, innovative and technically-astute mobile developer, well-versed in analyzing user needs and developing software to precisely meet diverse needs. Very keen to learn new programming languages and proactively keeps up with industry trends. Great knowledge in Flutter/Dart, BLoC pattern, Agile methodologies (Scrum/Kanban), Firebase, UI/UX, Figma, clean code, code version control with Git/Git Flow and Play Store and App Store app distributions.
sv: Extremamente apaixonado por tecnologia, inovativo e tecnicamente astuto desenvolvedor Flutter, com boas vivências em analisar as necessidades do usuário e desenvolver um produto que atenda diversas necessidades. Também estou bem disposto a aprender novas linguagens de programação e sempre me mantenho atualizado sobre as novas tendências de mercado. Ótimo conhecimento em Flutter/Dart, BLoC Pattern, Metodologias Ágeis(Scrum/Kanban), Firebase, UI/UX, Figma, códigos limpos e versionamento de código com Git/Git Flow e distribuições na Play Store e App Store.

# certificateCardCourseLabel
source: Course:
sv: Kurs:

# certificateCardCredentialLinkLabel
source: Credential
sv: Legitimation

# successSnackBarDepositionTitle
source: Deposition Sent!
sv: Vittnesmål skickat!

# successSnackBarDepositionAddedMessage
source: Thank you for leaving your deposition!
sv: Tack för att du lämnade ditt vittnesbörd!

# successSnackBarDepositionUpdatedMessage
source: Your deposition was updated!
sv: Ditt vittnesmål har uppdaterats!

# successSnackBarDepositionRemovedMessage
source: Deposition removed successfully.
sv: Vittnesmålet har tagits bort.

# depositionButtonNameHint
source: Full Name
sv: Fullt Namn

# depositionButtonRelationshipHint
source: Relationship
sv: Relation

# depositionButtonDepositionHint
source: Write something about me or my app!
sv: Skriv något om mig eller min app!

# depositionButtonSendButton
source: Send
sv: Att skicka

# existingDepositionDialogTitle
source: Existing Deposition
sv: Befintlig vittnesmål!

# existingDepositionDialogContent
source: You have writen a deposition already, if you wish to write a new one, the previous one will be updated!
sv: Du har redan skrivit ett vittnesmål, om du vill skicka en till kommer din tidigare vittnesmål att uppdateras!

# existingDepositionDialogUpdateButton
source: Update
sv: Att uppdatera

# existingDepositionDialogCancelButton
source: Cancel
sv: Annullera

# anonymousNameDeposition
source: Anonymous
sv: Anonym

# deleteDepositionDialogTitle
source: Delete Deposition
sv: Ta bort Vittnesmål

# deleteDepositionDialogcontent
source: Are you sure you want to delete this deposition?
sv: Är du säker på att du vill ta bort detta vittnesmål?

# deleteDialogCancelButton
source: Cancel
sv: Annullera

# depositionScreenEmptyMessage
source: There are still no depositions around here!
sv: Det finns inga vittnesmål här ännu!

# depositionScreenEmptySecondaryMessage
source: Why don't you write something?
sv: Varför skriver du inte något?

# depositionScreenEmptyAnonymousMessage
source: Please login if you want to write something.
sv: Logga in för att skriva något.

# urlMessage
source: Hello, Alexandre!
sv: Hej Alexandre!

# couldNotOpenUrlMessage
source: Could not launch Url!
sv: Det går inte att öppna webbadressen!

# errorOpenningUrlMessage
source: Error on launching Url!
sv: Ett fel uppstod när du försökte öppna webbadressen!

# certificateFormSendButton
source: Send
sv: Att skicka

# certificateFormUpdateButton
source: Update
sv: Att uppdatera

# certificateFormRemoveButton
source: Remove
sv: Att ta bort

# deleteCertificateDialogTitle
source: Delete Certificate
sv: Ta bort certifikat

# deleteCertificateDialogcontent
source: Are you sure you want to delete this certificate?
sv: Är du säker på att du vill ta bort det här certifikatet?

# certificateFormCourseLabel
source: Course
sv: Kurs

# certificateFormDurationLabel
source: Duration
sv: Varaktighet

# certificateFormDescriptionLabel
source: Description
sv: Beskrivning

# certificateFormDescriptionEnLabel
source: English Description
sv: Beskrivning på engelska

# certificateFormImageUrlLabel
source: Image Url
sv: Bild URL

# certificateFormCredentialUrlLabel
source: Credential Url
sv: Autentiseringsadress

# certificateFormScreenTitleAdd
source: Add Certificate
sv: Lägg till Certifikat

# certificateFormScreenTitleUpdate
source: Update Certificate
sv: Uppdatera Certifikat

# errorStateDialogTitle
source: Error
sv: Misstag

# errorStateDialogRetryButton
source: Retry
sv: Försök igen

# relationshipDataFriend
source: Friend
sv: Vän

# relationshipDataCoworker
source: Coworker
sv: Arbetskamrat

# relationshipDataClient
source: Client
sv: Klient

# relationshipDataFamily
source: Family
sv: Familj

# relationshipDataRecruiter
source: Recruiter
sv: Rekryterare

# snackBarGenericErrorTitle
source: Something went wrong!
sv: Något gick fel!

# snackBarGenericSuccessTitle
source: Success!
sv: Framgång!!

# snackBarGenericAlertTitle
source: Alert!
sv: Varning!

# successSnackBarAddedCertificate
source: A new certificate was added!
sv: Ett nytt certifikat har lagts till!

# successSnackBarUpdatedCertificate
source: Certificate updated successfully.
sv: Certifikatet har uppdaterats.

# successSnackBarRemovedCertificate
source: Certificate removed successfully.
sv: Certifikatet har tagits bort.

# workHistoryFormTitleAdd
source: Add Work History
sv: Lägg till Upplevelse

# workHistoryFormTitleUpdate
source: Update Work History
sv: Uppdatera Upplevelse

# workHistoryFormFieldCompanyLabel
source: Company
sv: Bolag

# workHistoryFieldOccupationsLabel
source: Occupations
sv: Sysselsättningar

# workHistoryFormSendButton
source: Send
sv: Att skicka

# workHistoryFormUpdateButton
source: Update
sv: Att uppdatera

# workHistoryFormAddButton
source: Add
sv: Tillägga

# deleteWorkHistoryDialogTitle
source: Delete Work History
sv: Ta bort Upplevelse

# deleteWorkHistoryDialogcontent
source: Are you sure you want to delete this work history?
sv: Är du säker på att du vill ta bort den här upplevelsen?

# successSnackBarAddedWorkHistory
source: A new work history was added!
sv: En ny upplevelse har lagts till!

# successSnackBarUpdatedWorkHistory
source: Work History updated successfully.
sv: Upplevelsen har uppdaterats.

# successSnackBarRemovedWorkHistory
source: Work History removed successfully.
sv: Upplevelsen har tagits bort.

# occupationsFormTitleAdd
source: Add Occupation
sv: Lägg till sysselsättning

# occupationsFormTitleUpdate
source: Update Occupation
sv: Uppdatera sysselsättning

# occupationsFormStartDateLabel
source: Start Date:
sv: Inledande datum:

# occupationsFormEndDateLabel
source: End Date:
sv: Slutdatum:

# occupationsFormCurrentOccupationLabel
source: Current Occupation
sv: Nuvarande sysselsättning

# occupationsFormRoleLabel
source: Role
sv: Roll

# occupationsFormDescriptionLabel
source: Description
sv: Beskrivning

# occupationsFormDescriptionEnLabel
source: English Description
sv: Beskrivning på engelska
